import xlrd
import pandas as pd

def statistics(file):
    # 打开文件，获取excel文件的workbook（工作簿）对象
    workbook = xlrd.open_workbook(file)  # 文件路径
    worksheet=workbook.sheet_by_index(0)

    nrow=worksheet.nrows
    print(nrow)

    district=['玄武区','秦淮区','建邺区','鼓楼区','浦口区','栖霞区','雨花台区','江宁区','六合区','溧水区','高淳区',
       '锡山区','惠山区','滨湖区','梁溪区','新吴区','江阴市','宜兴市',
       '鼓楼区','云龙区','贾汪区','泉山区','铜山区','丰县','沛县','睢宁县','新沂市','邳州市',
       '天宁区','钟楼区','新北区','武进区','金坛区','溧阳市',
       '虎丘区','吴中区','相城区','姑苏区','吴江区','常熟市','张家港市','昆山市','太仓市',
       '崇川区','港闸区','通州区','如东县','启东市','如皋市','海门市','海安市',
       '连云区','海州区','赣榆区','东海县','灌云县','灌南县',
       '淮安区','淮阴区','清江浦区','洪泽区','涟水县','盱眙县','金湖县',
       '亭湖区','盐都区','大丰区','响水县','滨海县','阜宁县','射阳县','建湖县','东台市',
       '广陵区','邗江区','江都区','宝应县','仪征市','高邮市',
       '京口区','润州区','丹徒区','丹阳市','扬中市','句容市',
       '海陵区','高港区','姜堰区','兴化市','靖江市','泰兴市',
       '宿城区','宿豫区','沭阳县','泗阳县','泗洪县']

    n=[0]*96

    for i in range(1,nrow):
        row= worksheet.row_values(i)
        for j in range(len(n)):
            if row[1]==district[j] and row[7]=='死亡':
                n[j]=n[j]+1

    print(n)
    print(sum(n))

    c={'行政区':district,"死亡人数" : n}
    data=pd.DataFrame(c)
    print(data)

if __name__=="__main__":
    statistics("F:\医学大数据课题\论文终稿修改\scientific report\返修\死亡率分析.xls")
